################################################################################
# Warning: this is an internal database file and is not intended for other usage
################################################################################
################################################################################
#
# Created by fc (V-2023.12-SP5-5) internalDesignWriter on Mon Apr 28 18:49:41 2025
#
################################################################################

################################################################################
#
# Units
# time_unit               : 1e-09
# resistance_unit         : 1000
# capacitive_load_unit    : 1e-12
# voltage_unit            : 1
# current_unit            : 0.001
# power_unit              : 1e-09
################################################################################

# Implemented: supplies

set_design_attributes -elements . -internal_attribute _mv_data_file_version 1
## Start - load_upf jpeg_encoder.upf on Mon Apr 28 17:48:41 2025
######## Create Power Domains ###########

create_power_domain TOP

## Toplevel Connections ######
#create_power_domain TOP

# VDD 
create_supply_port VDD
create_supply_net VDD -domain TOP
connect_supply_net VDD -ports VDD

# VSS (0.0V)
create_supply_port VSS
create_supply_net VSS -domain TOP
connect_supply_net VSS -ports VSS

### Establish Connections ################

set_domain_supply_net TOP -primary_power_net VDD -primary_ground_net VSS

### Create Power State Table ##################

add_port_state VDD -state {ON 0.9}
add_port_state VSS -state {OFF 0.0}

create_pst pst_top -supplies {VDD VSS}
add_pst_state ON -pst pst_top -state {ON OFF}



#set_voltage 0.63 -object VDD
#set_voltage 0.00 -object VSS
## End - load_upf jpeg_encoder.upf

## Constraints below are generated by snps. Please do not modify.
set derived_upf true

if ($derived_upf) {

set_design_attributes -elements . -internal_attribute _mv_data_status ready
set_design_attributes -elements . -internal_attribute _ldi_supply_nets {VDD \
    VSS} -internal_attribute _ldi_domains {{TOP+VDD+VSS}}
set_design_attributes -elements . -internal_attribute \
    _disallow_fwd_biasing_domains { TOP+false }
set_design_attributes -elements . -internal_attribute \
    _disallow_rvs_biasing_domains { TOP+false }

}
set derived_upf false
